package com.ws.until;

public class Convert {
    public static double[] ConvertLatAndLng(double x,double y){

        double[] xy = new double[2];
        //江苏健谷
//        double X = 118.355374 + 0.00001141 * x;
//        double Y = 34.111442 - (0.00000899 * y);
//        江苏宿迁慈溪药业
//        double X = 118.354001 + 0.00001141 * x;
//        double Y = 34.104630 - (0.00000899 * y);
        // 新亚科技
//        double X = 118.3540012753763 + 0.00000044822 * x * 0.23;
//        double Y = 34.10204006918888 + (0.00001186183 * y * 0.23);

        // 长青
//        double X = 121.055720 + 0.000007038156 * ((x - 485.26875) *0.6);
//        double Y = 32.542893 + 0.000001262874 * ((y-53.95250 )* 0.6);
//        double X = 121.052492 + 0.00001141 * (x*0.6-500);
//        double Y = 32.545049 - (0.00000899 * (y*0.6-38));
        double X = 118.99055421352388 + 0.00001141 * (x-580)*0.38;
        double Y = 33.36819173484879 + (0.00000899 * (y-60)*0.38);
        xy[0] = X;
        xy[1] = Y;
        return xy;
    }
    public static void main(String[] args) {
       double num[];
       double x=
               1472.6;
       double y = 107.36;
       num = ConvertLatAndLng(x,y);
        for(int i=0;i<num.length;i++)
        {
            System.out.println(num[i]);
        }
    }
}
//118.99055421352388　纬度：33.36819173484879

//-540-70
//    double X = 118.99055421352388 + 0.00001141 * (x-540)*0.38;
//    double Y = 33.36819173484879 + (0.00000899 * (y-70)*0.38);
//    double x=
//            1258.20;
//    double y = 625.76;

//    double X = 118.99055421352388 + 0.00001141 * (x-500)*0.38;
//    double Y = 33.36819173484879 + (0.00000899 * (y-40)*0.38);
//    double x=
//            557.4;
//    double y = 1009.760;

//    double X = 118.99055421352388 + 0.00001141 * (x-450)*0.38;
//    double Y = 33.36819173484879 + (0.00000899 * (y-50)*0.38);
//    double x=
//            448.60;
//    double y = 94.56;

//    double X = 118.99055421352388 + 0.00001141 * (x-580)*0.38;
//    double Y = 33.36819173484879 + (0.00000899 * (y-60)*0.38);
//    double x=
//            1472.6;
//    double y = 107.36;